Repository: 84000/data-translation-memory
Catalog: toh158-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཟས་ཟ་བ་ཡང་ལུས་བརྒྱན་པའི་ཕྱིར་ཟས་ཟ་བ་མ་ཡིན། ལུས་བདེ་བར་བྱ་བའི་ཕྱིར་མ་ཡིན་ཏེ། གཞན་དུ་ན་ཇི་ཙམ་ལུས་དང་འབྲེལ་བའི་དགེ་བའི་ཕྱོགས་བསྒྲལ་བའི་ཕྱིར་རོ་སྙམ་དུ་སེམས་ཉེ་བར་གཞག་པར་བྱའོ། །
en: Similarly, when bodhisattvas eat food, they do not eat in order to beautify the body or to please the body, but rather in order to be able to do those virtuous activities that require a body and that lead to liberation.

source: ཚངས་པ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་གཉེན་པོས་སེམས་ཤེས་པར་བྱེད་མི་ནུས་ན། དེས་འདི་སྙམ་དུ་བསམ་པར་བྱ་སྟེ། སེམས་ཞེས་བྱ་བ་འདིས་ནི་མཐར་ཕྱིན་པར་དཀའ་བ།
en: “Brahmā, if bodhisattvas are not able to understand the mind with the antidotes taught by the Tathāgata, then they should reflect as follows: ‘that which we call “the mind” is difficult to perfect.

source: མི་འཐུན་པར་འཛིན་པ། འཁོར་བ་ལ་མངོན་དུ་ཕྱོགས་པ།
en: It grasps inappropriately.

source: དགེ་བའི་ཕྱོགས་ལ་མི་ཕྱོགས་པ། ཡུལ་ལ་མངོན་དུ་ཕྱོགས་པ།
en: It is drawn toward saṃsāra and not toward that which is virtuous.

source: དབེན་པ་ལ་མི་ཕྱོགས་པ།
en: It is drawn toward society and not toward seclusion.

source: བདེ་བ་ལ་མངོན་དུ་ཕྱོགས་པ། སྡུག་བསྔལ་ལ་མི་ཕྱོགས་པ།
en: It is drawn toward pleasure and not toward suffering.

source: སྨྲ་བ་ལ་དགའ་བ་ལ་མངོན་དུ་ཕྱོགས་པ། དེ་ཁོ་ན་ལ་རྣམ་པར་ལྟ་བ་ལ་མི་ཕྱོགས་པ།
en: It is drawn toward the joy of speaking and not toward the view of reality.

source: མི་གཙང་བ་ལ་མངོན་དུ་ཕྱོགས་པ། གཙང་བ་ལ་མི་ཕྱོགས་པ། གདུལ་དཀའ་བ། གཟུང་དཀའ་བ། གནས་མེད་པ།
en: It is drawn toward the impure and not toward the pure.

source: རྟེན་མེད་པ། གསོག །གསོབ། སྐད་ཅིག་པ། རྒྱུ་དང་རྐྱེན་ཚོགས་པ་ལས་བྱུང་བ་ཡིན་ན།
en: It is hard to control, it is hard to catch, for it is baseless, void, hollow, momentary, and arises from combinations of causes and conditions.

source: མཁས་པའི་རང་བཞིན་ཅན་སུ་ཞིག་འདི་ལྟ་བུའི་རང་བཞིན་ཅན་གྱི་སེམས་ཀྱི་དབང་དུ་འགྲོ་ཞིང་རྗེས་སུ་འཇུག་སྙམ་དུ་བསམ་མོ། །
en: Who among those who are intelligent by nature would let themselves be led astray by the mind, which has such a nature?’

source: དེ་དེ་ལྟར་སེམས་དྲན་པ་ཉེ་བར་གནས་པས་སེམས་གདུལ་བའི་ཕྱིར་ནན་ཏན་བྱེད་དོ། །
en: They think in this way and, by developing awareness of the mind like this, they make effort to tame the mind.

source: དེ་སེར་སྣའི་སེམས་གདུལ་བའི་ཕྱིར་སྦྱིན་པ་སྦྱིན་པར་བྱེད་དེ།
en: “In order to tame the tendency toward miserliness, they practice giving.

source: ཐ་ན་ཁམ་གཅིག་ཙམ་མམ། རྒྱ་ཤུག་ཙམ་མམ། མོན་སྲན་གྲེའུ་ཙམ་མམ། ཏིལ་འབྲུ་ཙམ་ཡང་རུང་། དེ་ཡང་ཐམས་ཅད་ལ་སྦྱིན་པར་བྱེད་ཀྱི། སྡུག་པ་རྣམས་ལ་མ་ཡིན། འདྲིས་པ་རྣམས་ལ་ཡིན་ནོ། །
en: Even giving a single mouthful of food, just a berry, a bean, or a grain of sesame, is enough, so long as it is offered to anyone, and not just to those whom one already holds dear or with whom one is already acquainted.

source: དེ་འཆལ་བའི་ཚུལ་ཁྲིམས་ཀྱི་སེམས་གདུལ་བའི་ཕྱིར་ཚུལ་ཁྲིམས་བསྲུང་སྟེ། ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་སྐྱོན་མེད་པར་བྱེད་པ་ཡིན། འདྲེན་མར་མི་བྱེད་པ་ཡིན།
en: “In order to tame the tendency toward immoral conduct, they guard their discipline and do not commit misdeeds of body, speech, or mind.

source: ནག་ནོག་ཅན་དུ་མི་བྱེད་པ་ཡིན་ཏེ།
en: They do not get mixed up with or stained by such faults.

source: ཚུལ་ཁྲིམས་དེས་བདག་ལ་སྟོད་པར་མི་བྱེད། གཞན་ལ་སྨོད་པར་མི་བྱེད་དོ། །
en: Also, those with moral discipline do not praise themselves or disparage others.

source: དེ་གནོད་སེམས་ཀྱི་སེམས་འདུལ་བའི་ཕྱིར་བཟོད་པ་སྒོམ་སྟེ།
en: “In order to tame the tendency toward ill will, they cultivate forbearance.

source: དེ་གྲོང་ངམ་གྲོང་རྡལ་དུ་ཞུགས་པ་ན་གཤེ་ཡང་ཅི་མི་སྙམ་པར་བྱེད་དོ། །
en: When they enter cities or towns, they take no notice of the abuse they receive.

source: བརྒྱབ་ཀྱང་རུང་རྡེག་ཀྱང་རུང་། སྡིགས་ཀྱང་རུང་། རྣམ་པར་འཇོམས་ཀྱང་རུང་། སྨོད་ཀྱང་རུང་སྟེ་ཅི་མི་སྙམ་པར་བྱེད་དོ། །
en: Even if they are struck, beaten, threatened, overpowered, and insulted, they think nothing of it.

source: ཀྱེ་མ་དགེ་སྦྱོང་འདི་ནི་མགོ་རེག་ངན་པའོ། །
en: Even if they are harangued by local people, saying, ‘Oh these śrāmaṇas with shaved heads are bad!

source: ཀྱེ་མ་དགེ་སྦྱོང་འདི་ནི་མགོ་རེག་མི་སྡུག་པ་ངན་པའོ་ཞེས་འཇིག་རྟེན་གྱིས་དཔྱས་ཀྱང་ཅི་མི་སྙམ་པར་བྱེད་དོ། །
en: Oh, these śrāmaṇas with ugly shaved heads are bad!’—they think nothing of it.

source: ཡང་དག་པར་མ་ཡིན་པས་སྐུར་ཀྱང་བཟོད་པར་བྱེད་ཅིང་དང་དུ་ལེན་ལ། ལས་བདག་གིར་བྱ་བ་ཉིད་ལ་རྟོན་ཏེ།
en: Even when they are slandered with false accusations, they accept it with forbearance and remain focused on what they have to do.

source: བཟོད་པ་དེས་ཀྱང་བདག་ལ་སྟོད་པར་མི་བྱེད། གཞན་ལ་སྨོད་པར་མི་བྱེད་དོ། །དེ་ལེ་ལོའི་སེམས་གདུལ་བའི་ཕྱིར་དང་།
en: And those with forbearance do not praise themselves or disparage others.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་མ་ཐོབ་པ་རྣམས་ཐོབ་པར་བྱ་བའི་ཕྱིར་དང་། ཐོབ་པ་རྣམས་འཕེལ་བར་བྱ་བའི་ཕྱིར་དང་། འཕེལ་བ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་དང་། ཡོངས་སུ་སྨིན་པ་རྣམས་ཡང་དག་པར་གཟུང་བར་བྱ་བའི་ཕྱིར་དང་། ཡང་དག་པར་གཟུང་བ་རྣམས་རྣམ་པར་དབྱེ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་མོ། །
en: “In order to tame the tendency toward indolence, to attain those qualities oriented toward awakening that have not yet been attained, to develop those that have already been attained, to mature those that have been developed, to master those that have been matured, and to refine those that have been mastered, they apply effort.

source: དེ་སེམས་ཅན་གྱི་ཆེད་རྣམས་དང་སེམས་ཅན་གྱི་བྱ་བ་རྣམས་ལ་ཡོངས་སུ་མི་སྐྱོ་ཞིང་ཡོངས་སུ་ཡི་མི་ཆད་དེ། ཡོངས་སུ་སྐྱོ་བའི་སེམས་མི་སྐྱེད་དོ། །
en: When acting for the sake of beings, they do not grow weary, they do not despair, and they do not lose heart.

source: དེ་གདོལ་པ་ལ་ཕན་གདགས་ཀྱང་རུང་། རྒྱལ་པོ་ལ་ཕན་གདགས་ཀྱང་རུང་། ཤིན་ཏུ་ལམ་རིང་པོར་ཡང་འགྲོ་སྟེ། ཐ་དད་པ་མི་དམིགས་ཤིང་རྒྱུན་མི་གཅོད་པ་ཡིན་ནོ། །
en: Whether it is to benefit an outcaste or a king, they will always go the distance for them, without prejudice.

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སྡུག་བསྔལ་ཞིང་བཀྲེན་པའི་སེམས་ཅན་གྱི་དངོས་པོ་ཐམས་ཅད་ངན་པ་ཞིག་གིས་གཏམས་སམ། འབྱོར་ཅིང་ནོར་ཆེ་བ་གང་ཡང་རུང་བ་ཞིག་གིས་དངོས་པོ་བཟང་པོ་མཆོག་གྱ་ནོམ་པ་ཞིག་བསྟབས་ཀྱང་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་བརྩེ་བའི་སེམས་བཞག་ལ་གུས་པར་བསྟོད་ཅིང་།
en: Whether bodhisattvas are offered some base, second-rate object by a miserable and destitute person, or a supremely wonderful gift by a prosperous and wealthy person, bodhisattvas have compassion.

source: ཡང་དག་པར་གཟེངས་བསྟོད་ལ། ཡང་དག་པར་འཛིན་དུ་གཞུག་ཅིང་དངོས་པོ་ངན་པ་དེ་བླང་བར་བྱའོ། །
en: They praise them respectfully, encourage and reassure them, and accept the second-rate object.

source: འདི་ལྟ་སྟེ། སྡུག་བསྔལ་བའི་སྦྱིན་པ་འདི་ནི་སྦྱིན་པ་བྱ་དཀའ་བ་ཡིན་པའི་ཕྱིར་རོ། །
en: Because it is not an easy thing for a miserable person to give a gift.

source: དེ་རྣམ་པར་གཡེང་བའི་སེམས་གདུལ་བའི་ཕྱིར་བསམ་གཏན་ལ་བསམ་གཏན་པར་བྱེད་དོ། །
en: “In order to tame the tendency toward distraction, they develop stable meditative concentration.

source: ཇི་ལྟར་བསམ་གཏན་བྱེད་ཅེ་ན།
en: How do they practice concentration?

source: ཚངས་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐོག་མ་ཁོ་ནར་ལུས་ལེགས་པར་བསྡམས་པ་ཡིན་ནོ། །
en: Brahmā, first of all, bodhisattvas control their body well.

source: ལུས་དབེན་པར་གནས་པ་ཡིན་ནོ། །ལུས་ཀྱི་འདུ་འཛི་རྣམས་ཀྱང་ཡོངས་སུ་སྤོང་ངོ་། །
en: Physically, they live in seclusion and avoid physical contact.

source: ལུས་ལ་ལྷག་པར་ཆགས་པ་ཡང་འདོར་རོ། །
en: They give up excessive attachment to the body.

source: ལུས་ལྕི་བ་འམ་ཡང་བ་ཡང་ཤེས་སོ། །
en: When the body is lethargic or agitated, they are aware of it.

source: ལུས་དང་འཐུན་པ་དང་། ལུས་འཚོ་བ་དང་། ལུས་ཀྱི་སྟོབས་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: They know what agrees with their body, what sustains it, and what makes it strong.

source: ངག་ལེགས་པར་བསྡམས་པ་ཡིན་ཏེ།
en: Likewise, they control their speech well.

source: སྨྲ་བ་ཉུང་ཞིང་བརྗོད་པ་ཉུང་ངོ་། །
en: They speak little and their answers are short.

source: དོན་སྨྲ་བ་ཡིན་ཞིང་རིགས་པ་སྨྲ་བ་ཡིན་ཏེ།
en: What they do say is meaningful and reasonable.

source: བྲེ་མོའི་གཏམ་ལ་དགའ་བ་ཡོངས་སུ་སྤོང་བ་ཡིན་ནོ། །
en: They abandon any delight in frivolous talk.

source: དེ་ཡིད་ལེགས་པར་བསྡམས་པ་ཡིན་ཏེ།
en: Likewise, they also control the mind well.

source: མི་དགེ་བའི་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་སོ། །
en: They renounce all unwholesome thoughts.

source: དེ་དེ་ལྟར་གནས་གསུམ་ཡོངས་སུ་དག་པས་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོའི་གཟུགས་རྣམས་མི་སྣང་བར་བྱ་བའི་ཕྱིར་ནན་ཏན་བྱེད་དེ། དེ་དག་ལ་མཚན་མར་མི་འཛིན་མངོན་རྟགས་སུ་མི་འཛིན་ཏོ། །
en: “By purifying the three places in this way, they strive to make blue, yellow, red, and white visible forms disappear, not grasping at them as characteristics and not grasping at them as evidence.

source: རྒྱན་དང་གོས་ཀྱི་རྣམ་པ་སྣ་ཚོགས་དག་ལ་ཡང་མཚན་མར་མི་འཛིན་ཅིང་མངོན་རྟགས་སུ་མི་འཛིན་པ་ཡིན་ནོ། །
en: They do not grasp onto the characteristics of adornments and clothing or take them as indications of some object.

source: གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་པ་སྣ་ཚོགས་པ་དག་ལ་ཡང་མཚན་མར་མི་འཛིན་ཅིང་མངོན་རྟགས་སུ་མི་འཛིན་པ་ཡིན་ནོ། །
en: They do not grasp onto the characteristics of various visible forms, sounds, smells, tastes, and tangible objects, or take them as indications.

source: སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་རྣམས་ལ་ཡང་མཚན་མར་མི་འཛིན་ཅིང་མངོན་རྟགས་སུ་མི་འཛིན་པ་ཡིན་ནོ། །
en: They do not grasp onto the characteristics of men, women, boys, and girls, nor take them as indications.

source: དེ་གཅིག་པུ་དབེན་པར་འདུག་ནས་ནང་དུ་ཡང་དག་པར་འཇོག་ཅིང་སེམས་གནས་པར་བྱ་བའི་ཕྱིར་ནན་ཏན་བྱེད་དེ། མི་སྡུག་པ་ལ་དམིགས་པའམ།
en: “They stay alone in seclusion, settle inwardly, and strive to make the mind stable.

source: བྱམས་པ་ལ་དམིགས་པའམ། སྙིང་རྗེ་ལ་དམིགས་པའམ། ཡིད་འབྱུང་བར་འགྱུར་བ་གང་ཡང་རུང་བས་ཇི་ལྟར་ལུས་ཁེངས་པར་མི་འགྱུར་བ་དེ་ལྟར་དམིགས་པར་བྱེད་དེ། དབུགས་རྔུབ་པ་དང་འབྱུང་བ་མི་འགག་གོ། །རྒྱུན་རྣམས་ཀྱང་མི་འཆད་དོ་རླུང་འཁྲུག་པར་མི་འགྱུར་རོ། །
en: Whether taking repulsion as the object of meditation, loving-kindness as the object, or compassion as the object, any despondency that may arise is focused on in the same way, without any physical tension, and the flow of the in breath and the out breath is maintained without interruption so that the wind element is not disturbed.

source: སེམས་ལོག་པར་རྣམ་པར་གཡེང་བར་མི་འགྱུར་རོ། །
en: Their minds do not veer off and get distracted.

source: དེ་འཆག་གམ། ཉལ་ལམ། འགྲེང་ངམ། འདུག་ཀྱང་དམིགས་པ་དེ་ཉིད་ཀྱིས་འདུག་གོ། །དེ་ཉིད་ལ་སེམས་གཏོད་དོ། །
en: Whether walking, lying, standing, or sitting, they stay with the object and they keep their mind focused on it.

source: ཚངས་པ་གང་གི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་དམིགས་པ་ལ་སེམས་བརྟན་པར་གྱུར་པ་དེའི་ཚེ་སེམས་ལ་སེམས་མཉམ་པར་འཇོག་སྟེ། སེམས་ཀྱིས་སེམས་ཀྱང་མི་དམིགས་སོ། །
en: “Brahmā, once bodhisattvas have achieved stability of mind when focused on an object, they enter meditative equipoise on the mind, in which even the mind is not apprehended as an object by the mind.

source: གང་གིས་མཉམ་པར་འཇོག་པ་དེ་ཡང་མི་དམིགས་སོ། །གང་གི་ཕྱིར་མཉམ་པར་འཇོག་པ་དེ་ཡང་མི་དམིགས་སོ། །
en: The one who is in meditative equipoise is not apprehended and the purpose of meditative equipoise is not apprehended.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: They think to themselves, ‘Alas!

source: ཀྱེ་མ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་འདི་དག་ནི་གསོག་གི་ཆོས་རྣམས་དང་། གསོབ་ཀྱི་ཆོས་རྣམས་ལ་མངོན་པར་ཞེན་ཏོ་སྙམ་དུ་སེམས་ཏེ།
en: Foolish ordinary people are fixated on worthless, hollow things.’

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལྷག་མཐོང་ཞེས་བྱའོ། །
en: This is called the special insight of bodhisattvas.

source: དེ་ལྟར་རྣམ་པར་མཐོང་བས་ཉོན་མོངས་པ་རྣམས་ཀུན་ཏུ་མི་འབྱུང་ཞིང་མི་འཇུག་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཞི་གནས་ཞེས་བྱའོ། །
en: With such insight, they neither engage with mental afflictions nor produce them anew. This is called the calm abiding of bodhisattvas.

source: ཚངས་པ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་པུ་དབེན་པར་འདུག་སྟེ་ནང་དུ་ཡང་དག་བཞག་ནས་མིང་དང་ཡི་གེ་ཇི་ལྟར་ཐོས་པ་རྣམས་ངེས་པའི་ཚིག་གི་གདགས་པས་ཡང་དག་པར་འཇོག་ཅིང་ཡི་གེ་དེ་དག་ལ་ཉེ་བར་རྟོགས་ཏེ།
en: “Brahmā, moreover, when bodhisattvas staying in seclusion are settled inwardly, they contemplate the names and letters they have heard and think about what is actually signified by words.

source: དེ་དེ་ལྟར་ཉེ་བར་རྟོགས་པ་ན་ཡི་གེ་རྣམས་གསོག་དང་གསོབ་ཏུ་མཐོང་ངོ་། །
en: When they examine words in this way, they see that letters are worthless and hollow.

source: དེ་ཡི་གེ་རྣམ་པ་གསོག་དང་གསོབ་ཏུ་མཐོང་ནས་མིང་རྣམས་ཀྱང་གསོག་དང་གསོབ་ཏུ་མཐོང་ངོ་། །
en: Having seen that letters are worthless and hollow, they see that names are worthless and hollow.

source: གང་ལ་མིང་དེ་འདོགས་པ་དེ་ཡང་གསོག་དང་གསོབ་ཏུ་མཐོང་ངོ་། །
en: They see that what is signified by a name is also worthless and hollow.

source: དེ་ལ་གཟུགས་གང་དང་གང་སྣང་བ་དེ་དང་དེ་ཡང་གསོག་དང་གསོབ་ཏུ་མཐོང་ངོ་། །
en: They see that any forms that may appear are worthless and hollow.

source: དེ་གསོག་དང་གསོབ་ཏུ་མཐོང་བས་ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཤེས་པར་འགྱུར་རོ། །
en: By seeing them as worthless and hollow, they correctly understand them.

source: ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་ཡོངས་སུ་ཤེས་པས་དེ་ལ་འདུས་བྱས་རྨི་ལམ་དང་འདྲ་བར་སྣང་ངོ་། །
en: Because they correctly understand them, conditioned phenomena come to appear as dreamlike.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སོ་སོར་བརྟགས་ནས་སེམས་ཅན་ལ་ལྟ་བས་སྙིང་རྗེ་ཆེན་པོའི་སེམས་ཉེ་བར་བཞག་ནས་གནས་སོ། །
en: Having examined phenomena in this way, they rest with their minds firmly established in great compassion toward sentient beings.

source: དེ་འཆལ་པའི་ཤེས་རབ་ཀྱི་སེམས་གདུལ་བའི་ཕྱིར་ཤེས་རབ་སྒོམ་པར་བྱེད་དོ། །
en: “In order to tame the tendency toward erroneous understanding, they cultivate wisdom.

source: ཇི་ལྟར་སྒོམ་པར་བྱེད་ཅེ་ན།
en: How do they cultivate it?

source: དེ་ཀུན་རྫོབ་ཀྱི་ཚུལ་དུ་བཤད་པ་འམ་དོན་དམ་པའི་ཚུལ་དུ་བཤད་པའི་མདོ་སྡེ་གང་དག་ཡིན་པ་དེ་དག་བརྗོད་པ་གསལ་ཞིང་ཟུར་ཕྱིན་པ་དག་གིས་མ་ནོར་བར་འཛིན་ཏོ། །
en: They take as unerring all sūtras—whether expounded by means of relative truth or expounded by means of ultimate truth—that have been clearly and lucidly expressed.

source: མ་ནོར་བས་ཆོས་སྟོན་པ་ལས་བཟུང་ནས་ཀྱང་། །མ་ནོར་བའི་བསམ་པས་སེམས་པར་བྱེད་དོ། །
en: They reflect unerringly on what they have understood from the Dharma that has been unerringly taught therein.

source: སྒོམ་པའི་རྣལ་འབྱོར་ལ་ཡང་བརྩོན་པར་བྱེད་དོ། །
en: They apply themselves with effort to the yoga of meditation.

source: དེ་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་ཤེས་རབ་ཀྱི་བྱེ་བྲག་གིས་སེམས་ཅན་མི་དམིགས། སྲོག་མི་དམིགས། གསོབ་མི་དམིགས། སྐྱེས་བུ་མི་དམིགས། གང་ཟག་མི་དམིགས།
en: With the strength of gnosis and wisdom in particular, they do not apprehend sentient beings, they do not apprehend life, they do not apprehend hollowness, they do not apprehend people, they do not apprehend persons, they do not apprehend humankind, and they do not apprehend humanity.

source: ཤེད་ལས་སྐྱེས་མི་དམིགས། ཤེད་བུ་མི་དམིགས་ཏེ། ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་ཆད་པར་ལྟ་བར་ཡང་མི་ལྷུང་ངོ་། །
en: “Nevertheless, they do not fall into the view of nihilism about everything.

source: བཏགས་པའི་ཐ་སྙད་རྣམས་ལ་ཡང་ལེགས་པར་བསླབ་པ་ཡིན་ནོ། །དེ་ཟིན་པའི་སའི་ཁམས་དང་།
en: They carefully study imputed designations.

source: མ་ཟིན་པའི་སའི་ཁམས་ལ་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ཚུལ་གཅིག་ཏུ་སོ་སོར་རྟོག་གོ། །
en: With correct wisdom, they analyze the inner earth element and the outer earth element as being one.

source: ཟིན་པའི་ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། མ་ཟིན་པ་ལ་ཡང་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ཚུལ་གཅིག་ཏུ་སོ་སོར་རྟོག་སྟེ་དེ་གཉི་ག་ཡང་གསོག་ཉིད་དང་གསོབ་ཉིད་དུ་མཐོང་ཞིང་།
en: With correct wisdom, they likewise analyze the inner water element, fire element, wind element, and their outer counterparts, as being one.

source: བེམས་པོ་ཉིད་དང་།
en: They see both kinds of elements as worthless and hollow.

source: སྙིང་པོ་མེད་པ་ཉིད་དང་། སྟོང་པ་ཉིད་དུ་མཐོང་ངོ་། །
en: They see them as inanimate, essenceless, and as emptiness.

source: དེས་དེ་ལྟར་མཐོང་བས་ཇི་ལྟར་ཕྱི་རོལ་གྱི་ཁམས་རྣམས་ལ་མངོན་པར་ཆགས་པ་མེད་པ་དེ་ལྟར་ནང་གི་རྣམས་ལ་ཡང་ངོ་། །
en: Because they see them as such, just as they are not attached to the external elements, they are also not attached to the internal elements.

source: མིག་གི་རྣམ་པར་ཤེས་པ་དང་། གཟུགས་རྣམས་ལ་ཡང་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ཚུལ་གཅིག་ཏུ་སོ་སོར་རྟོག་གོ། །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་།
en: “With wisdom, they analyze visual consciousness and physical forms as being one.

source: སྒྲ་རྣམས་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། དྲི་རྣམས་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། རོ་རྣམས་དང་།
en: With wisdom, they analyze auditory consciousness and sounds, olfactory consciousness and smells, gustatory consciousness and tastes, and tactile consciousness and tangible objects as being one.

source: ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། རེག་བྱ་རྣམས་ལ་ཡང་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ཚུལ་གཅིག་ཏུ་སོ་སོར་རྟོག་གོ། །དེའི་སའི་ཁམས་ལ་ནི་སྲ་བ་ཉིད་དུ་ཡང་རབ་ཏུ་ཤེས་ལ་གཤེར་བ་ཉིད་དང་། ཚ་བ་ཉིད་དང་། ཁོང་སྟོང་ཉིད་དུ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: “Regarding the earth element, they recognize its solidity but also recognize its wetness, heat, and insubstantiality.

source: ཆུའི་ཁམས་ལ་གཤེར་བ་ཉིད་དུ་ཡང་རབ་ཏུ་ཤེས་ལ་སྲ་བ་ཉིད་དང་། ཚ་བ་ཉིད་དང་། ཁོང་སྟོང་ཉིད་དུ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: Regarding the water element, they recognize its wetness but also recognize its solidity, heat, and insubstantiality.

source: མེའི་ཁམས་ལ་ཚ་བ་ཉིད་དུ་ཡང་རབ་ཏུ་ཤེས་ལ་སྲ་བ་ཉིད་དང་། གཤེར་བ་ཉིད་དང་། ཁོང་སྟོང་ཉིད་དུ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: Regarding the fire element, they recognize its heat but also recognize its solidity, wetness, and insubstantiality.

source: རླུང་གི་ཁམས་ལ་གཡོ་བ་ཉིད་དུ་ཡང་རབ་ཏུ་ཤེས་ལ་ཡང་ཞིང་གཡོ་བ་ཉིད་དུ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: Regarding the wind element, they recognize its motility and they also recognize its buoyant motility.

source: དེ་ནམ་མཁའི་ཁམས་ལ་ཁོང་སྟོང་ཉིད་དུ་ཡང་རབ་ཏུ་ཤེས་ལ་ཐམས་ཅད་དུ་ཡང་སོང་བ་ཉིད་དུ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: Regarding the space element, they recognize its insubstantiality and they recognize that it pervades everything.

source: རྣམ་པར་ཤེས་པའི་ཁམས་ལ་སྒྱུ་མ་ལྟ་བུ་ཉིད་དུ་ཡང་རབ་ཏུ་ཤེས་ལ་ཕྱིན་ཅི་ལོག་ཉིད་དུ་ཡང་རབ་ཏུ་ཤེས། ཕྱིན་ཅི་མ་ལོག་པ་ཉིད་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: They recognize the consciousness element as being like an illusion; they recognize it to be both mistaken and not mistaken.

source: དེ་མིག་གི་རྣམ་པར་ཤེས་པ་ལ་སྟོང་པ་ཉིད་དང་། གཟུགས་ལ་མི་རྟག་པ་ཉིད་དུ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: They recognize the visual consciousness as emptiness and visible forms as impermanence.

source: རྣ་བའི་རྣམ་པར་ཤེས་པ་ལ་སྟོང་པ་ཉིད་དང་། སྒྲ་ལ་མི་རྟག་པ་ཉིད་དང་།
en: They recognize the auditory consciousness as emptiness and sounds as impermanence.

source: སྣའི་རྣམ་པར་ཤེས་པ་ལ་སྟོང་པ་ཉིད་དང་། དྲི་ལ་མི་རྟག་པ་ཉིད་དང་།
en: They recognize the olfactory consciousness as emptiness and smells as impermanence.

source: ལྕེའི་རྣམ་པརཤེས་པ་ལ་སྟོང་པ་ཉིད་དང་། རོ་ལ་མི་རྟག་པ་ཉིད་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་ལ་སྟོང་པ་ཉིད་དང་། རེག་བྱ་ལ་མི་རྟག་པ་ཉིད་དུ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: They recognize the gustatory consciousness as emptiness and tastes as impermanence They recognize the tactile consciousness as emptiness and tangible objects as impermanence.

source: དེ་དེ་ལྟར་ཤེས་རབ་ལ་མཁས་པས་ཤིན་ཏུ་རྟོགས་པའི་ཤེས་རབ་དང་ལྡན་ཞིང་ཤེས་རབ་རྣོ་བ་དང་ལྡན་ཏེ།
en: “Learned in wisdom, they have the wisdom that fully realizes and the wisdom that is sharp.

source: མི་དགེ་བའི་ཆོས་རྣམས་ཀྱང་རབ་ཏུ་ཤེས། དགེ་བའི་ཆོས་རྣམས་ཀྱང་རབ་ཏུ་ཤེས།
en: They recognize those dharmas that are nonvirtuous and they recognize those dharmas that are virtuous.

source: ཉན་ཐོས་ཡང་དག་པར་འགྲུབ་པར་བྱེད་པའི་ཆོས་རྣམས་ཀྱང་རབ་ཏུ་ཤེས།
en: They recognize the dharmas that bring hearers their attainment.

source: རང་སངས་རྒྱས་ཡང་དག་པར་འགྲུབ་པར་བྱེད་པའི་ཆོས་རྣམས་དང་།
en: They recognize the dharmas that bring solitary realizers their attainment.

source: བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་འགྲུབ་པར་བྱེད་པའི་ཆོས་རྣམས་དང་།
en: They recognize the dharmas that bring bodhisattvas their attainment.

source: སངས་རྒྱས་ཉིད་ཡང་དག་པར་འགྲུབ་པར་བྱེད་པའི་ཆོས་རྣམས་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: They recognize the dharmas that bring buddhas their attainment.

source: དེ་མི་དགེ་བའི་ཆོས་རྣམས་ཀྱིས་རྣམ་པར་སྨིན་པ་ཆུང་ངུ་དང་། འབྲིང་དང་། ཆེན་པོ་སེམས་ཅན་དམྱལ་བ་རྣམས་དང་། དུད་འགྲོ་རྣམས་དང་། །ཡི་དགས་རྣམས་སུ་སྐྱེ་བ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: “They recognize how the weak, middling, and strong ripening of nonvirtuous dharmas leads to rebirth as ghosts, animals, and hell beings.

source: དེར་སྐྱེས་པ་རྣམས་ཀྱི་ཚོར་བ་ཆུང་ངུ་དང་། འབྲིང་དང་། ཆེན་པོ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: They recognize the weak, middling, and strong feelings of beings who are reborn in those realms.

source: དགེ་བའི་ཆོས་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ཆུང་ངུ་དང་། འབྲིང་དང་། ཆེན་པོ་ལྷ་རྣམས་ཀྱི་ནང་དུའམ། མི་རྣམས་ཀྱི་ནང་དུ་སྨིན་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: They recognize how the weak, middling, and strong ripening of virtuous dharmas leads to rebirth among gods or humans.

source: དེར་སྐྱེས་པ་རྣམས་ཀྱི་འབྲས་བུ་ཆུང་ངུ་དང་། འབྲིང་དང་། ཆེན་པོ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: And they recognize how the karmic fruits for those reborn there may be weak, middling, and strong.

source: ཉན་ཐོས་ཡང་དག་པར་འགྲུབ་པར་བྱེད་པའི་ཆོས་རྣམས་ཀྱི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་དུ་བྱ་བ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་མངོན་དུ་བྱ་བ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་དུ་བྱ་བ་དང་། དགྲ་བཅོམ་པ་ཉིད་ཀྱི་འབྲས་བུ་མངོན་དུ་བྱ་བའི་རྣམ་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: “They recognize the dharmas that bring hearers their full attainment: actualizing the fruit of stream-entry, actualizing the fruit of being a once-returner, actualizing the fruit of being a non-returner, and actualizing the fruit of arhatship.

source: ཤེས་རབ་ཀྱི་རྣམ་པར་གྲོལ་བ་ཉིད་དང་། གཉིས་ཀའི་ཆ་ལས་རྣམ་པར་གྲོལ་བ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: They recognize both liberation through wisdom and the twofold liberation.

source: རང་སངས་རྒྱས་ཡང་དག་པར་འགྲུབ་པར་བྱེད་པའི་ཆོས་རྣམས་ཀྱིས་ཡང་དག་པར་འགྲུབ་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: They recognize the dharmas that bring solitary realizers their full attainment.

source: འབྲས་བུ་དང་ཞི་བ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: They recognize their karmic fruits and their peace.

source: བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་འགྲུབ་པར་བྱེད་པའི་ཆོས་རྣམས་ཀྱི་ཚོགས་ཀྱི་ལམ་ཡང་རབ་ཏུ་ཤེས་སོ། །ཡེ་ཤེས་ཀྱི་ལམ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: They recognize the dharmas that bring bodhisattvas their full attainment: they recognize the path of accumulation and the path of gnosis.

source: ཤེས་ནས་ཀྱང་ཚོགས་ཀྱི་ལམ་དང་ཡེ་ཤེས་ཀྱི་ལམ་ལ་བརྩོན་པར་བྱེད་དོ། །
en: Knowing them, they endeavor to progress on the path of accumulation and the path of gnosis.

source: སངས་རྒྱས་ཉིད་ཡང་དག་པར་འགྲུབ་པར་བྱེད་པའི་ཆོས་རྣམས་ཀྱི་རྫུ་འཕྲུལ་ཆེ་བ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས་སོ། །མཐུ་ཆེ་བ་ཉིད་དང་། དམ་པ་ཉིད་དང་། རབ་མཆོག་ཉིད་དང་། ཕུལ་དུ་བྱུང་བ་ཉིད་དང་། ཆེ་བ་ཉིད་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། ཐུན་མོང་བ་ཡང་མ་ཡིན་ན། གཞན་སེམས་ཅན་ཐམས་ཅད་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་པའི་ཐུན་མོང་མ་ཡིན་པ་ཉིད་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: They recognize the dharmas that bring the full attainment of buddhahood: great miraculous manifestation, great power, holiness, excellence, preeminence, and greatness, which are not shared by any hearer, solitary realizer, and bodhisattva, not to mention other sentient beings.

source: དེ་དེ་ལྟར་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་དྲན་པ་ལེགས་པར་ཉེ་བར་གནས་པ་སྡིག་པའི་ཆོས་ཐམས་ཅད་དང་ནི་བྲལ། དགེ་བའི་ཆོས་ནི་ཡང་དག་པར་ཐོབ།
en: “In this way, they view all phenomena in accordance with the Dharma and properly maintain mindfulness, free from all sinful dharmas, and fully replete with virtuous dharmas.

source: ལུས་ཀྱི་གནོད་པ་ནི་མེད། རྣམ་པར་ཤེས་པས་འཕངས་པ་ནི་མེད། སེམས་ཀྱིས་འཕངས་པ་ནི་མེད་ལ་ཆོས་རྣམས་ཀྱི་རྒྱུའི་ཚོགས་དང་འབྲས་བུ་ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པས།
en: They commit no bodily harm, they are not thrown off by consciousness, they are not thrown off by mind, for they understand the complex of causes and fruits of dharmas just as they are.

source: དཔེར་ན་རྒྱ་མཚོའི་རླབས་བཞིན་དུ་དགེ་བའི་ཆོས་རྣམས་ཀྱིས་རྣམ་པར་འཕེལ་ཏེ།
en: “By analogy, virtuous dharmas spread like ocean waves.

source: ཇི་ལྟར་རྒྱ་མཚོའི་རླབས་འབྲི་ཞིང་ཡང་འབྱུང་བ་ལྟར། བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་རྣམས་ལས་དེ་ལྟ་མ་ཡིན་ནོ། །
en: But unlike ocean waves that come in only to recede again, for bodhisattvas, those dharmas do not recede.

source: དེ་དཔེར་ན་ཟླ་བ་ཡར་གྱི་ངོའི་ཟླ་བའི་དཀྱིལ་འཁོར་དང་འདྲ་བར་དགེ་བའི་ཆོས་རྣམས་ཀྱིས་མངོན་པར་འཕེལ་ཏེ།
en: Rather the virtuous dharmas grow like the waxing moon.

source: ཇི་ལྟར་མར་གྱི་ངོ་ལ་ཟླ་བའི་དཀྱིལ་འཁོར་འབྲི་བའི་ཆོས་ཅན་ཡིན་པ་ལྟར། བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་རྣམས་ལས་དེ་ལྟ་མ་ཡིན་ནོ། །
en: But unlike how the waning moon recedes, for bodhisattvas, those dharmas do not recede.

source: དཔེར་ན་དབྱར་གྱི་དུས་ཀྱི་ཕུ་ཆུ་བྲུག་པ་ལྟར་དགེ་བའི་ཆོས་རྣམས་ཀྱིས་མངོན་པར་འཕེལ་ཏེ།
en: The virtuous dharmas grow like a raging torrent in the summertime.
